IDENTIFICATION DIVISION.
    PROGRAM-ID. WALKTIME.
DATA DIVISION.
WORKING-STORAGE SECTION.
    01 HRS PIC 9.
    01 MINS PIC 99.
    01 SEED PIC 9(8) COMP.
PROCEDURE DIVISION.
    ACCEPT SEED FROM TIME. 
    COMPUTE HRS = FUNCTION RANDOM(SEED) * 3 + 1.
    COMPUTE MINS = FUNCTION RANDOM(SEED) * 60
    DISPLAY HRS":"MINS"PM".
STOP RUN.
